/* No comment provided by engineer. */
"%@ copied to clipboard" = "%@ kopioida leikepöydälle";

/* No comment provided by engineer. */
"%d Confirmations" = "%d Vahvistukset";

/* No comment provided by engineer. */
"%d more" = "%enemmän d";

/* No comment provided by engineer. */
"%d Transactions" = "%d Liiketoimet";

/* No comment provided by engineer. */
"Account Settings" = "Tilin Asetukset";

/* No comment provided by engineer. */
"Active" = "Aktiivinen";

/* No comment provided by engineer. */
"Add to Address book?" = "Lisää Osoite kirja?";

/* No comment provided by engineer. */
"An error occured validating your PIN code with the remote server. You may be offline or blockchain may be experiencing difficulties. Would you like retry validation or instead enter your password manually?" = "Virhe tapahtui validointi PIN-koodin etäpalvelimen kanssa. Sinulla saattaa olla offline-tilassa tai blockchain voi olla vaikeuksia. Haluatko yrittää uudelleen validointi tai sen sijaan anna salasana manuaalisesti?";

/* No comment provided by engineer. */
"An error was encountered loading your wallet. You may be offline or Blockchain is experiencing difficulties. Please close the application and try again later or re-pair you device." = "Virhe oli kohdannut lisäys lompakon. Sinulla saattaa olla offline-tilassa tai Blockchain on vaikeuksia. Ole hyvä ja sulje sovellus ja kokeile myöhemmin uudelleen tai uudelleen parin laite.";

/* No comment provided by engineer. */
"Any Address" = "Jokin Osoite";

/* No comment provided by engineer. */
"Archive" = "Arkisto";

/* No comment provided by engineer. */
"Archived" = "Arkistoitu";

/* No comment provided by engineer. */
"Automatically" = "Automaattisesti";

/* No comment provided by engineer. */
"Before accessing your wallet, please choose a pin number to use to unlock your wallet. It's important you remember this pin as it cannot be reset or changed without first unlocking the app." = "Ennen kuin pääset lompakon, anna pin-numero, jos haluat käyttää avata lompakon. On tärkeää, muistatte tämän pin-koodin, koska se ei voi palauttaa tai vaihtaa ilman, että ensin lukituksen app.";

/* No comment provided by engineer. */
"Bitcoin Address" = "Bitcoin-Osoite";

/* No comment provided by engineer. */
"Cancel" = "Peruuta";

/* No comment provided by engineer. */
"Cannot save PIN Code while wallet is not initialized or password is null" = "Ei voi tallentaa PIN-Koodin, kun lompakko ei ole alustettu tai salasana on tyhjä";

/* No comment provided by engineer. */
"Change PIN" = "Muuta PIN-koodi";

/* No comment provided by engineer. */
"Close App" = "Sulje Sovellus";

/* No comment provided by engineer. */
"Confirm Payment" = "Vahvista Maksu";

/* No comment provided by engineer. */
"Confirm payment of %@ (%@) to %@" = "Vahvista maksu%1$@ (%2$@) %3$@";

/* No comment provided by engineer. */
"Create Wallet" = "Luo Lompakon";

/* No comment provided by engineer. */
"Decrypted PIN Password length 0" = "Purettu PIN-Salasanan pituus 0";

/* No comment provided by engineer. */
"Decrypting Private Key" = "Yksityisen Avaimen Salauksen";

/* No comment provided by engineer. */
"Enter Password" = "Anna Salasana";

/* No comment provided by engineer. */
"Error" = "Virhe";

/* No comment provided by engineer. */
"Failed To Load Wallet" = "Epäonnistui Lompakko";

/* No comment provided by engineer. */
"Finished Signing Inputs" = "Valmis Allekirjoituksen Tulot";

/* No comment provided by engineer. */
"Forget Details" = "Unohda Tiedot";

/* No comment provided by engineer. */
"Forget Wallet" = "Unohda Lompakko";

/* No comment provided by engineer. */
"How would you like to pair?" = "Miten haluaisit pari?";

/* No comment provided by engineer. */
"If you already have a Blockchain Wallet, choose Pair Device; otherwise, choose Create Wallet.    It's Free! No email required." = "Jos sinulla on jo Blockchain Lompakko, valitse Pari Laitetta; muussa tapauksessa valitse Luo Lompakon. Se on Ilmainen! Ei sähköpostiosoitetta tarvitaan.";

/* No comment provided by engineer. */
"Imported Private Key %@" = "Tuotu Yksityinen Avain %@";

/* No comment provided by engineer. */
"Information" = "Lisätietoja";

/* No comment provided by engineer. */
"Invalid email address." = "Virheellinen sähköpostiosoite.";

/* No comment provided by engineer. */
"Invalid GUID" = "Virheellinen GUID";

/* No comment provided by engineer. */
"Invalid Identifier" = "Virheellinen Tunnus";

/* No comment provided by engineer. */
"Invalid Send Value" = "Virheellinen Lähettää Arvo";

/* No comment provided by engineer. */
"Invalid Shared Key" = "Virheellinen Jaettu Avain";

/* No comment provided by engineer. */
"Invalid Status Code Returned %@" = "Virheellinen Tila-Koodi Palautetaan %@";

/* No comment provided by engineer. */
"Invalid to bitcoin address" = "Virheellinen, jos bitcoin-osoite";

/* No comment provided by engineer. */
"Loading External Page" = "Lisäys Ulkoinen Sivu";

/* No comment provided by engineer. */
"Logout" = "Kirjaudu ulos";

/* No comment provided by engineer. */
"Manually" = "Manuaalisesti";

/* No comment provided by engineer. */
"No" = "N : o";

/* No comment provided by engineer. */
"No Label" = "Ei Tunnusta";

/* No comment provided by engineer. */
"No Password Entered" = "Salasanaa Ei Ole Syötetty";

/* No comment provided by engineer. */
"OK" = "OK";

/* No comment provided by engineer. */
"Open Account Settings, Logout or change your pin below." = "Avaa Tilin Asetukset, kirjaudu Ulos-tai vaihtaa pin-tunnuksen alla.";

/* No comment provided by engineer. */
"Options" = "Valinnat";

/* No comment provided by engineer. */
"Pair Device" = "Pari Laite";

/* No comment provided by engineer. */
"Parsing Pairing Code" = "Jäsentämiseen Pairing Code";

/* No comment provided by engineer. */
"Password must 10 characters or longer" = "Salasana on 10 merkkiä tai pidempään";

/* No comment provided by engineer. */
"Passwords do not match" = "Salasanat eivät täsmää";

/* No comment provided by engineer. */
"Payment Sent!" = "Maksu Lähetetty!";

/* No comment provided by engineer. */
"PIN Encrypted String is nil" = "PIN-Salattu String on nolla";

/* No comment provided by engineer. */
"PIN Response Object key or value length 0" = "PIN-Vastaus-Objekti-avain tai arvo pituus 0";

/* No comment provided by engineer. */
"PIN Response Object success length 0" = "PIN-Vastaus-Objektin menestys pituus 0";

/* No comment provided by engineer. */
"PIN Saved Successfully" = "PIN Tallennettu";

/* No comment provided by engineer. */
"PIN Validation cannot be completed. Please enter your wallet password manually." = "PIN-koodin Validointi ei voida suorittaa loppuun. Anna lompakon salasanan manuaalisesti.";

/* No comment provided by engineer. */
"PIN Validation Error" = "PIN-koodin Validointi Virhe";

/* No comment provided by engineer. */
"Please enter your 36 character wallet identifier correctly. It can be found in the welcome email on startup." = "Kirjoita 36 merkki lompakko tunniste oikein. Se löytyy tervetuloa sähköposti käynnistyksen yhteydessä.";

/* No comment provided by engineer. */
"Please provide an email address." = "Ole hyvä ja anna sähköpostiosoitteesi.";

/* No comment provided by engineer. */
"Please Wait" = "Ole Hyvä Ja Odota";

/* No comment provided by engineer. */
"Retry Validation" = "Yritä Uudelleen Validointi";

/* No comment provided by engineer. */
"Scan Watch Only Address?" = "Scan Katsella Vain Osoite?";

/* No comment provided by engineer. */
"Second Password Incorrect" = "Toinen Virheellinen Salasana";

/* No comment provided by engineer. */
"Send Payment From:" = "Lähetä Maksua:";

/* No comment provided by engineer. */
"Send Payment To:" = "Lähetä Maksut:";

/* No comment provided by engineer. */
"Server Returned Null Status Code" = "Palvelin Palauttaa Null-Tilakoodi";

/* No comment provided by engineer. */
"Signing Input %d" = "Allekirjoituksen Input %d";

/* No comment provided by engineer. */
"Signing Inputs" = "Allekirjoituksen Tulot";

/* No comment provided by engineer. */
"Success" = "Menestys";

/* No comment provided by engineer. */
"The private key you are attempting to import is encrypted. Please enter the password below." = "Yksityinen avain yrität tuoda, on salattu. Anna salasana alla.";

/* No comment provided by engineer. */
"This action requires the second password for your bitcoin wallet. Please enter it below and press continue." = "Tämä toiminta edellyttää toisen salasanan bitcoin-lompakon. Ole hyvä ja syötä se alla ja paina jatka.";

/* No comment provided by engineer. */
"This will erase all wallet data on this device. Please confirm you have your wallet information saved elsewhere otherwise any bitcoins in this wallet will be inaccessible!!" = "Tämä poistaa kaikki lompakon tiedot tämä laite. Ole hyvä ja vahvista olet lompakon tiedot tallennettu muualle, muuten kaikki bitcoins tässä lompakko pääse!!";

/* No comment provided by engineer. */
"Unarchive" = "Unarchive";

/* No comment provided by engineer. */
"Unconfirmed" = "Vahvistamaton";

/* No comment provided by engineer. */
"Unsupported Private Key Format" = "Ei Tuettu Yksityinen Avain-Muodossa";

/* No comment provided by engineer. */
"User Declined" = "Käyttäjä Laskivat";

/* No comment provided by engineer. */
"Wallet address %@ has funds available to spend. However the private key needs to be scanned from a paper wallet or QR Code. Would you like to scan the private key now?" = "Lompakko-osoite %@ on käytettävissä olevista varoista viettää. Kuitenkin yksityinen avain on skannattu paperi lompakko tai QR-Koodi. Haluatko tarkistaa yksityinen avain on nyt?";

/* No comment provided by engineer. */
"Wallet Paired Successfully." = "Lompakko Muodostettu Onnistuneesti.";

/* No comment provided by engineer. */
"Warning!!!" = "Varoitus!!!";

/* No comment provided by engineer. */
"Welcome Back" = "Tervetuloa Takaisin";

/* No comment provided by engineer. */
"Welcome to Blockchain Wallet" = "Tervetuloa Blockchain Lompakko";

/* No comment provided by engineer. */
"Would you like to add the bitcoin address %@ to your address book?" = "Haluaisitko lisätä bitcoin-osoite %@ osoitekirjaan?";

/* No comment provided by engineer. */
"Yes" = "Kyllä";

/* No comment provided by engineer. */
"You have no active bitcoin addresses available for sending" = "Sinulla ei ole aktiivinen bitcoin-osoitteet käytettävissä lähettämiseen";

/* No comment provided by engineer. */
"You must enter a destination address" = "Sinun täytyy antaa määränpään osoite";

/* No comment provided by engineer. */
"You must enter a label" = "Sinun on syötettävä merkki";

/* No comment provided by engineer. */
"Your wallet was successfully created." = "Lompakossa oli onnistuneesti luotu.";

